#include<stdio.h>
#include<stdlib.h>
#include<conio.h>
#include<time.h>
void shuru(char a[10][10][10]);
int hefa(char a[10][10][10]);
void shuchu(char a[10][10][10],int b);
int zhengjie(char a[10][10][10]);
void JByunsuan(char a[10][10][10]);
int meiju(char a[10][10][10]);
int ZJ2(char a[10][10][10]);
void TSshuju1(char a[10][10][10]);
void TSshuju2(char a[10][10][10]);

int M;
int T;
int K,K1,P1,P2;


int main()
{
//	printf("欢迎进入数独求解程序！\n");
	char dbug;
	do{
		char a[10][10][10];
		shuru(a);
	//	TSshuju2(a);
		P1=P2=0;
		M=0;
		T=clock();
		K=K1=0;
		int t=clock();
		printf("\n数独的情况如下：\n");
		if(hefa(a))
		{
			int kong=0,kong1=0;
			printf("\n数独合法\n");
			for(int i=1;i<=9;i++)
				for(int j=1;j<=9;j++)
					if(a[0][i][j]=='0')
						kong++;
			printf("空格数：%d\n",kong);
			JByunsuan(a);
		//	shuchu(a,0);
			for(int i=1;i<=9;i++)
				for(int j=1;j<=9;j++)
					if(a[0][i][j]=='0')
						kong1++;
			printf("通过基本运算解决的空格数：%d\n",kong-kong1);
			printf("基本运算后的空格数：%d\n",kong1);
			if(!zhengjie(a))
				if(!ZJ2(a))
				{
					P1++;
					meiju(a);
				}
				else
					printf("该数独共有0个解。\n");
			else
			{
				M++;
			//	printf("\n第%d个解：\n",M);
				shuchu(a,0);
			}
			printf("该数独共有%d解。\n",M);
			printf("最少回溯次数：%d\n",P2);
			printf("最大回溯次数：%d\n",P1);
		}
		else
			printf("该数独共有0个解。\n");
		printf("共用时%dms\n",clock()-t);
		printf("\n运算结束，退出请按q，按c继续:");
		while((dbug=getch())!='q'&&dbug!='c');
	}while(dbug!='q');
	return 0;
}


void shuru(char a[10][10][10])
{
	printf("\n请输入待解数独，有数的地方写数字，待填的地方写‘0’。\n");
	int i,j;
	char c;
	for(i=1;i<=9;i++)
	{
		if(i==1)
			printf("\n|-------|-------|-------|\n");
		for(j=1;j<=9;j++)
		{
			c=getch();
			if(c!='\b')
			{
				if((c=='0')||((c>='1')&&(c<='9')))
				{
					if(j==1)
						printf("| ");
					a[0][i][j]=c;
					printf("%c ",a[0][i][j]);
					if(j%3==0)
						printf("| ");
					if(j==9)
						printf("\n");
				}
				else
				{
					j--;
					continue;
				}
			}
			else
			{
				if(j!=1)
				{
					if(j==4||j==7||j==2)
						printf("\b\b\b\b    \b\b\b\b");
					else
						printf("\b\b  \b\b");
					j--;
					j--;
					continue;
				}
				else
				{
					j--;
					continue;
				}
			}
		}
		if(i%3==0)
			printf("|-------|-------|-------|\n");
	}
}


int hefa(char a[10][10][10])
{
	int i,j,k,num=0;
	char z;
	for(z='1';z<='9';z++)
	{
		for(i=1;i<=9;i++)
		{
			for(j=1;j<=9;j++)
				if(a[0][i][j]==z)
					num++;
			if(num>1)
				return 0;
			num=0;
		}
		for(i=1;i<=9;i++)
		{
			for(j=1;j<=9;j++)
				if(a[0][j][i]==z)
					num++;
			if(num>1)
				return 0;
			num=0;
		}
		for(k=1;k<=3;k++)
		{ 
			for(j=(k-1)*3+1;j<=k*3;j++)
				for(i=(k-1)*3+1;i<=k*3;i++)
					if(a[0][j][i]==z)
						num++;
			if(num>1)
				return 0;
			num=0;
		}
	}
	return 1;
}


void shuchu(char a[10][10][10],int b)
{
	int i,j;
	printf("\n");
	for(i=1;i<=9;i++)
	{
	    if(i==1)
			printf("|-------|-------|-------|\n");
		for(j=1;j<=9;j++)
		{
		    if(j==1)
				printf("| ");
		    printf("%c ",a[b][i][j]);
		    if(j%3==0)
				printf("| ");
		    if(j==9)
				printf("\n");
	    }
	    if(i%3==0)
			printf("|-------|-------|-------|\n");
    }
}


int zhengjie(char a[10][10][10])
{
	int i,j;
	for(i=1;i<=9;i++)
		for(j=1;j<=9;j++)
			if(a[0][i][j]=='0')
				return 0;
	return 1;
}


int ZJ2(char a[10][10][10])
{
	int i1,j1,k1;
	for(i1=1;i1<=9;i1++)
		for(j1=1;j1<=9;j1++)
			for(k1=1;k1<=9;k1++)
				if(a[i1][j1][k1]=='0')
					return 0;	
	return 1;
}


void JByunsuan(char a[10][10][10])
{
	int i,j,k=0;
	char z;
	for(i=1;i<=9;i++)
		for(j=1;j<=9;j++)
			for(k=1;k<=9;k++)
				a[i][j][k]='0';
	k=0;
	for(z='1';z<='9';z++)
	{
		int word=0,num=0;
		k++;
		for(i=1;i<=9;i++)
			for(j=1;j<=9;j++)
			{
				if(a[0][i][j]!='0')
					a[k][i][j]='1';
				if(a[0][i][j]==z)
				{
					int m;
					for(m=1;m<=9;m++)
						a[k][i][m]=a[k][m][j]='1';
					int x,y;
					for(x=(i-1)/3*3+1;x<=(i-1)/3*3+3;x++)
						for(y=(j-1)/3*3+1;y<=(j-1)/3*3+3;y++)
							a[k][x][y]='1';
				}
			}
		for(i=1;i<=9;i++)
		{
			for(j=1;j<=9;j++)
				if(a[k][i][j]=='0')
					num++;
			if(num==1)
			{
				for(j=1;j<=9;j++)
					if(a[k][i][j]=='0')
					{
						a[0][i][j]=z;
					}
				word=1;
				break;
			}
			num=0;
			for(j=1;j<=9;j++)
				if(a[k][j][i]=='0')
					num++;
			if(num==1)
			{
				for(j=1;j<=9;j++)
					if(a[k][j][i]=='0')
					{
						a[0][j][i]=z;
					}
				word=1;
				break;
			}
			num=0;
		}
		if(word==1)
		{
			z='0';
			k=0;
			continue;
		}
	}
}


int meiju(char a[10][10][10])
{
	if(((clock()-T)>=10000)&&(M==0)&&(K1==0))
	{
		printf("\n运算时间已经超过了10s，请检查输入的数据是否有误。\n");
		printf("有误，重来请按y\n无误，我想继续请按n: ");
		char cbug;
		while((cbug=getch())!='y'&&cbug!='n');
		if(cbug=='y')
		{
			K=1;
			K1=1;
			printf("\n");
			return 0;
		}
		K1=1;
		printf("\n");
	}
	int i,j,k=0;
	char z;
	for(z='1';z<='9';z++)
	{
		k++;
		for(i=1;i<=9;i++)
		{
			int b[11]={0};
			int p;
			for(j=1;j<=9;j++)
				if(a[k][i][j]=='0')
					for(p=1;p<=9;p++)
						if(b[p]==0)
						{
							b[p]=j;
							break;
						}
			if(b[1]!=0)
			{
				for(p=1;p<=10;p++)
				{
					if(b[p]!=0)
					{
						char c[10][10];
						int x1,x2;
						for(x1=1;x1<=9;x1++)
							for(x2=1;x2<=9;x2++)
								c[x1][x2]=a[0][x1][x2];
						a[0][i][b[p]]=z;
						JByunsuan(a);
				        if(zhengjie(a))
						{
							M++;
							P2=P1;
						//	shuchu(a,0);
						}
						if((!zhengjie(a))&&(!ZJ2(a)))
						{
							P1++;
							meiju(a);
							if(K==1)
								return 0;
						}
						for(x1=1;x1<=9;x1++)
							for(x2=1;x2<=9;x2++)
								a[0][x1][x2]=c[x1][x2];
					}
					else
						return 0;
				}
			}
		}
	}	
}


void TSshuju1(char a[10][10][10])
{
	/*调试数据1,有且只有一解*/
	a[0][1][1]='0';
	a[0][1][2]='0';
	a[0][1][3]='1';
	a[0][1][4]='0';
	a[0][1][5]='0';
	a[0][1][6]='9';
	a[0][1][7]='0';
	a[0][1][8]='0';
	a[0][1][9]='6';
	a[0][2][1]='0';
	a[0][2][2]='0';
	a[0][2][3]='5';
	a[0][2][4]='4';
	a[0][2][5]='8';
	a[0][2][6]='0';
	a[0][2][7]='0';
	a[0][2][8]='9';
	a[0][2][9]='3';
	a[0][3][1]='0';
	a[0][3][2]='0';
	a[0][3][3]='0';
	a[0][3][4]='0';
	a[0][3][5]='0';
	a[0][3][6]='0';
	a[0][3][7]='0';
	a[0][3][8]='8';
	a[0][3][9]='0';
	a[0][4][1]='0';
	a[0][4][2]='3';
	a[0][4][3]='0';
	a[0][4][4]='0';
	a[0][4][5]='0';
	a[0][4][6]='5';
	a[0][4][7]='4';
	a[0][4][8]='0';
	a[0][4][9]='1';
	a[0][5][1]='0';
	a[0][5][2]='7';
	a[0][5][3]='0';
	a[0][5][4]='0';
	a[0][5][5]='0';
	a[0][5][6]='0';
	a[0][5][7]='0';
	a[0][5][8]='3';
	a[0][5][9]='0';
	a[0][6][1]='1';
	a[0][6][2]='0';
	a[0][6][3]='6';
	a[0][6][4]='3';
	a[0][6][5]='0';
	a[0][6][6]='0';
	a[0][6][7]='0';
	a[0][6][8]='5';
	a[0][6][9]='0';
	a[0][7][1]='0';
	a[0][7][2]='6';
	a[0][7][3]='0';
	a[0][7][4]='0';
	a[0][7][5]='0';
	a[0][7][6]='0';
	a[0][7][7]='0';
	a[0][7][8]='0';
	a[0][7][9]='0';
	a[0][8][1]='0';
	a[0][8][2]='5';
	a[0][8][3]='0';
	a[0][8][4]='0';
	a[0][8][5]='9';
	a[0][8][6]='3';
	a[0][8][7]='2';
	a[0][8][8]='0';
	a[0][8][9]='0';
	a[0][9][1]='3';
	a[0][9][2]='0';	
	a[0][9][3]='0';
	a[0][9][4]='5';
	a[0][9][5]='0';
	a[0][9][6]='0';
	a[0][9][7]='6';
	a[0][9][8]='0';
	a[0][9][9]='0';
}


void TSshuju2(char a[10][10][10])
{
	/*调试数据2,有21个不同解*/
	a[0][1][1]='0';
	a[0][1][2]='0';
	a[0][1][3]='1';
	a[0][1][4]='0';
	a[0][1][5]='3';
	a[0][1][6]='9';
	a[0][1][7]='5';
	a[0][1][8]='2';
	a[0][1][9]='6';
	a[0][2][1]='0';
	a[0][2][2]='0';
	a[0][2][3]='5';
	a[0][2][4]='0';
	a[0][2][5]='8';
	a[0][2][6]='0';
	a[0][2][7]='0';
	a[0][2][8]='9';
	a[0][2][9]='3';
	a[0][3][1]='0';
	a[0][3][2]='0';
	a[0][3][3]='3';
	a[0][3][4]='0';
	a[0][3][5]='5';
	a[0][3][6]='0';
	a[0][3][7]='0';
	a[0][3][8]='8';
	a[0][3][9]='0';
	a[0][4][1]='0';
	a[0][4][2]='3';
	a[0][4][3]='0';
	a[0][4][4]='0';
	a[0][4][5]='0';
	a[0][4][6]='5';
	a[0][4][7]='4';
	a[0][4][8]='6';
	a[0][4][9]='1';
	a[0][5][1]='5';
	a[0][5][2]='7';
	a[0][5][3]='0';
	a[0][5][4]='0';
	a[0][5][5]='6';
	a[0][5][6]='0';
	a[0][5][7]='0';
	a[0][5][8]='3';
	a[0][5][9]='0';
	a[0][6][1]='1';
	a[0][6][2]='0';
	a[0][6][3]='6';
	a[0][6][4]='3';
	a[0][6][5]='0';
	a[0][6][6]='0';
	a[0][6][7]='0';
	a[0][6][8]='5';
	a[0][6][9]='0';
	a[0][7][1]='0';
	a[0][7][2]='6';
	a[0][7][3]='0';
	a[0][7][4]='0';
	a[0][7][5]='1';
	a[0][7][6]='0';
	a[0][7][7]='3';
	a[0][7][8]='0';
	a[0][7][9]='5';
	a[0][8][1]='0';
	a[0][8][2]='5';
	a[0][8][3]='0';
	a[0][8][4]='6';
	a[0][8][5]='9';
	a[0][8][6]='3';
	a[0][8][7]='2';
	a[0][8][8]='1';
	a[0][8][9]='0';
	a[0][9][1]='3';
	a[0][9][2]='1';	
	a[0][9][3]='0';
	a[0][9][4]='5';
	a[0][9][5]='0';
	a[0][9][6]='0';
	a[0][9][7]='6';
	a[0][9][8]='0';
	a[0][9][9]='0';
}